20260119080218-software_development_lifecycle_sdlc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Development Lifecycle (SDLC)</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Software Development Lifecycle (SDLC)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0d7e7ff">1. Software Development Lifecycle (SDLC)</a></li>
<li><a href="#orgbdc3b85">2. Software Development Lifecycle (SDLC)</a></li>
<li><a href="#orgaaff9c8">3. Summary</a></li>
<li><a href="#orgd60d746">4. Core Phases</a>
<ul>
<li><a href="#orgab73016">4.1. 1. Planning</a>
<ul>
<li><a href="#org26bb787">4.1.1. Job Roles:</a></li>
</ul>
</li>
<li><a href="#orga409cfb">4.2. 2. Requirements Analysis</a>
<ul>
<li><a href="#orga144e7e">4.2.1. Job Roles:</a></li>
</ul>
</li>
<li><a href="#orgfaa4356">4.3. 3. Design</a>
<ul>
<li><a href="#org1d8cef5">4.3.1. Job Roles</a></li>
</ul>
</li>
<li><a href="#orgaadebcd">4.4. 4. Implementation (Development)</a>
<ul>
<li><a href="#org4a64064">4.4.1. Job Roles</a></li>
</ul>
</li>
<li><a href="#org554ac5b">4.5. 5. Testing &amp; Verification</a>
<ul>
<li><a href="#org03ce5d5">4.5.1. Job Roles</a></li>
</ul>
</li>
<li><a href="#org041f11b">4.6. 6. Deployment</a>
<ul>
<li><a href="#org5678b74">4.6.1. Job Roles</a></li>
</ul>
</li>
<li><a href="#orgc8ffd51">4.7. 7. Maintenance &amp; Operations</a>
<ul>
<li><a href="#orga3505aa">4.7.1. Job Roles</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8c6afc2">5. Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0d7e7ff" class="outline-2">
<h2 id="org0d7e7ff"><span class="section-number-2">1.</span> Software Development Lifecycle (SDLC)</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><b>Planning</b></li>
<li><b>Requirements</b> <b>Analysis</b></li>
<li><b>Design</b></li>
<li><b>Development</b></li>
<li><b>Testing</b></li>
<li><b>Deployment</b></li>
<li><b>Maintenance</b></li>
</ol>
</div>
</div>

<div id="outline-container-orgbdc3b85" class="outline-2">
<h2 id="orgbdc3b85"><span class="section-number-2">2.</span> Software Development Lifecycle (SDLC)</h2>
<div class="outline-text-2" id="text-2">
<p>
The <b>Software Development Lifecycle (SDLC)</b> is a structured process for planning, building, testing, deploying, and maintaining software systems.
</p>

<p>
It provides a shared mental model for teams to reduce risk, improve quality, and align technical work with business goals.
</p>

<p>
SDLC is not a single methodology—rather, it is a meta-framework that different models (e.g., Waterfall, Agile, DevOps) interpret differently.
</p>

<p>
&#x2014;
</p>
</div>
</div>

<div id="outline-container-orgaaff9c8" class="outline-2">
<h2 id="orgaaff9c8"><span class="section-number-2">3.</span> Summary</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><b>Planning phase</b>: Suitable for roles requiring strategic thinking and business insight. Jobs include project manager, business analyst, and financial analyst.</li>
<li><b>Requirements analysis phase</b>: A great match for individuals who excel in gathering and documenting requirements. Common roles are system analyst and requirements analyst.</li>
<li><b>Design phase</b>: Attracts creative professionals like UI/UX designers, software architects, and database designers.</li>
<li><b>Development phase</b>: The most coding-intensive phase, where software developers, frontend and backend developers, and possible mobile app developers thrive.</li>
<li><b>Testing phase</b>: Focuses on quality assurance. That makes it a perfect match for QA engineers, test automation engineers, and security testers.</li>
<li><b>Deployment phase</b>: Requires expertise in infrastructure and automation, with roles like DevOps engineers, system administrators, and cloud engineers.</li>
<li><b>Maintenance phase</b>: Aims at sustaining the system over time, involving support engineers, maintenance engineers, and IT help desk specialists.</li>
</ol>
</div>
</div>



<div id="outline-container-orgd60d746" class="outline-2">
<h2 id="orgd60d746"><span class="section-number-2">4.</span> Core Phases</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgab73016" class="outline-3">
<h3 id="orgab73016"><span class="section-number-3">4.1.</span> 1. Planning</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Define scope, constraints, and success criteria</li>
</ul>
</div>

<div id="outline-container-org26bb787" class="outline-4">
<h4 id="org26bb787"><span class="section-number-4">4.1.1.</span> Job Roles:</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li><b>Project manager</b>: Oversees planning and resource allocation.</li>
<li><b>Business analyst</b>: Gathers and documents requirements.</li>
<li><b>Financial analyst</b>: Assesses the project's cost and ROI.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga409cfb" class="outline-3">
<h3 id="orga409cfb"><span class="section-number-3">4.2.</span> 2. Requirements Analysis</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Collect detailed requirements from stakeholders.</li>
<li>Analyse and document requirements in a software requirement specification (SRS).</li>
<li>Address potential challenges or constraints.</li>
</ul>
</div>

<div id="outline-container-orga144e7e" class="outline-4">
<h4 id="orga144e7e"><span class="section-number-4">4.2.1.</span> Job Roles:</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li><b>Requirements analyst</b>: Documents and manages system requirements.</li>
<li><b>System analyst</b>: Maps requirements to technical solutions.</li>
<li><b>Stakeholder coordinator</b>: Facilitates communication with clients.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfaa4356" class="outline-3">
<h3 id="orgfaa4356"><span class="section-number-3">4.3.</span> 3. Design</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Develop system architecture and high-level design (HLD).</li>
<li>Create detailed designs for modules, interfaces, and databases.</li>
<li>Prepare design specifications for developers.</li>
</ul>
</div>

<div id="outline-container-org1d8cef5" class="outline-4">
<h4 id="org1d8cef5"><span class="section-number-4">4.3.1.</span> Job Roles</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li><b>UI/UX designer</b>: Designs user interfaces and user experiences.</li>
<li><b>Software architect</b>: Creates the software architecture.</li>
<li><b>Database designer</b>: Develops database models and structures.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgaadebcd" class="outline-3">
<h3 id="orgaadebcd"><span class="section-number-3">4.4.</span> 4. Implementation (Development)</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Write code using programming languages.</li>
<li>Perform unit testing for each module.</li>
<li>Integrate individual components into the overall system.</li>
</ul>
</div>

<div id="outline-container-org4a64064" class="outline-4">
<h4 id="org4a64064"><span class="section-number-4">4.4.1.</span> Job Roles</h4>
<div class="outline-text-4" id="text-4-4-1">
<ul class="org-ul">
<li><b>Quality assurance (QA) engineer</b>: Tests the software for bugs.</li>
<li><b>Automation tester</b>: Writes test scripts for automation.</li>
<li><b>Performance tester</b>: Analyses system behaviour under load.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org554ac5b" class="outline-3">
<h3 id="org554ac5b"><span class="section-number-3">4.5.</span> 5. Testing &amp; Verification</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>Conduct functional, integration, and system testing.</li>
<li>Perform performance, security, and usability testing.</li>
<li>Fix issues and perform regression testing.</li>
</ul>
</div>

<div id="outline-container-org03ce5d5" class="outline-4">
<h4 id="org03ce5d5"><span class="section-number-4">4.5.1.</span> Job Roles</h4>
<div class="outline-text-4" id="text-4-5-1">
<ul class="org-ul">
<li><b>Quality assurance (QA) engineer</b>: Tests the software for bugs.</li>
<li><b>Automation tester</b>: Writes test scripts for automation.</li>
<li><b>Performance tester</b>: Analyses system behaviour under load.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org041f11b" class="outline-3">
<h3 id="org041f11b"><span class="section-number-3">4.6.</span> 6. Deployment</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>Release software to the production environment.</li>
<li>Monitor deployment for potential issues.</li>
<li>Train users and provide user manuals.</li>
</ul>
</div>

<div id="outline-container-org5678b74" class="outline-4">
<h4 id="org5678b74"><span class="section-number-4">4.6.1.</span> Job Roles</h4>
<div class="outline-text-4" id="text-4-6-1">
<ul class="org-ul">
<li><b>DevOps engineer</b>: Manages deployment pipelines and CI/CD tools.</li>
<li><b>System administrator</b>: Oversees production environment setup.</li>
<li><b>IT support specialist</b>: Assists users during deployment.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc8ffd51" class="outline-3">
<h3 id="orgc8ffd51"><span class="section-number-3">4.7.</span> 7. Maintenance &amp; Operations</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li>Fix bugs reported by users.</li>
<li>Implement software updates and patches.</li>
<li>Monitor system performance and scalability.</li>
</ul>
</div>

<div id="outline-container-orga3505aa" class="outline-4">
<h4 id="orga3505aa"><span class="section-number-4">4.7.1.</span> Job Roles</h4>
<div class="outline-text-4" id="text-4-7-1">
<ul class="org-ul">
<li><b>Support engineer</b>: Provides post-deployment support.</li>
<li><b>Maintenance engineer</b>: Handles bug fixes and updates.</li>
<li><b>System analyst</b>: Assesses changes required over time.</li>
</ul>
</div>
</div>
</div>
</div>



<div id="outline-container-org8c6afc2" class="outline-2">
<h2 id="org8c6afc2"><span class="section-number-2">5.</span> Notes</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>In practice, <b>SDLC</b> phases often overlap rather than occur sequentially.</li>
<li>Modern teams treat <b>SDLC</b> as a <code>continuous loop</code> rather than a <code>linear flow</code>.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
